src/mf2/conf/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьНаДиске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/mf2/conf/Catalogs/Сотрудники/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	Перем Имя, АдресХранилища;
	
	Если ПоместитьФайл(АдресХранилища, , Имя, Истина, ЭтаФорма.УникальныйИдентификатор) Тогда
		АдресФотографии = АдресХранилища;
		Объект.ПутьКФайлу = Имя;
		
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресФотографии) Тогда
		Если Объект.СохранятьНаДиске Тогда
			ТекущийОбъект.Фотография = Неопределено;
		Иначе
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФотографии);
			ТекущийОбъект.Фотография = Новый ХранилищеЗначения(ДвоичныеДанные);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресФотографии) И НЕ Объект.СохранятьНаДиске Тогда
		УдалитьИзВременногоХранилища(АдресФотографии);
		АдресФотографии = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "Фотография");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Объект.СохранятьНаДиске Тогда
		АдресФотографии = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Фотография");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.СохранятьНаДиске Тогда
		АдресХранилища = Неопределено;
		ПоместитьФайл(АдресХранилища, Объект.ПутьКФайлу, , Ложь, ЭтаФорма.УникальныйИдентификатор);
		АдресФотографии = АдресХранилища;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ПолучитьФайл(АдресФотографии, Объект.ПутьКФайлу, Истина);
КонецПроцедуры
